{
    "timestamp": "2024-10-27T12:09:43.197800",
    "articles": {
        "business": {
            "links": [
                "https://fortune.com/2024/10/25/boeing-space-business-sale-jeff-bezoss-blue-origin-elon-musk-spacex/",
                "https://www.cnbc.com/2024/10/25/delta-suit-against-crowdstrike-after-it-outage-caused-cancellations.html",
                "https://removed.com",
                "https://www.reuters.com/markets/us/futures-gain-treasury-yields-fall-tesla-slips-2024-10-25/",
                "https://thehill.com/newsletters/energy-environment/4954430-controversial-lithium-mine-gets-biden-approval/",
                "https://www.washingtonpost.com/business/2024/10/25/mike-jeffries-arraignment-abercrombie-fitch/",
                "https://fortune.com/2024/10/25/elon-musk-donald-trump-tesla-business-risk-factors-warning-shareholders/",
                "https://fortune.com/2024/10/25/walmart-employee-bakery-oven-death-halifax-gursimran-kaur-gofundme/",
                "https://www.usatoday.com/story/money/food/2024/10/25/jimmy-johns-pickle-sandwich-picklewich/75843191007/",
                "https://apnews.com/article/brazil-mining-collapse-settlement-bhp-samarco-vale-mariana-8b84c808fa25139e019d7981a3b7de19"
            ],
            "titles": [
                "Boeing may put its iconic space business up for sale and had talks with Jeff Bezos's Blue Origin, report says - Fortune",
                "Delta sues CrowdStrike after widespread IT outage that caused thousands of cancellations - CNBC",
                "[Removed]",
                "Nasdaq closes higher ahead of a heavy week of earnings - Reuters",
                "Controversial lithium mine gets Biden approval - The Hill",
                "Ex-Abercrombie & Fitch CEO pleads not guilty to sex trafficking charges - The Washington Post",
                "Could Elon Musk’s alliance with Donald Trump hurt Tesla's business? Not according to the company's list of 'risk factors' - Fortune",
                "Walmart employee looked for her daughter for hours before finding her 'charred remains' in the store's walk-in bakery oven - Fortune",
                "Jimmy John's unveils a new sandwich with giant pickles instead of bread: See what's on it - USA TODAY",
                "Brazil reaches a $23 billion settlement with mining firms over a 2015 environmental disaster - The Associated Press"
            ],
            "published_dates": [
                "2024-10-26T04:34:43Z",
                "2024-10-25T23:34:03Z",
                "2024-10-25T23:29:45Z",
                "2024-10-25T23:26:39Z",
                "2024-10-25T22:01:00Z",
                "2024-10-25T21:51:35Z",
                "2024-10-25T20:20:00Z",
                "2024-10-25T20:08:28Z",
                "2024-10-25T19:33:20Z",
                "2024-10-25T19:20:00Z"
            ],
            "sources": [
                "Jason Ma",
                "Jordan Novet, Leslie Josephs",
                null,
                "Lisa Mattackal, Purvi Agarwal, Carolina Mandl",
                "Rachel Frazin, Zack Budryk",
                "Julie Zauzmer Weil",
                "Jenn Brice",
                "Sasha Rogelberg",
                "Gabe Hauari",
                "GABRIELA SÁ PESSOA, ELÉONORE HUGHES"
            ],
            "descriptions": [
                "That could include the Starliner space taxi program and operations related to the International Space Station, sources told the Wall Street Journal.",
                "Delta is seeking damages for its losses from the July IT incident, as well as litigation costs and punitive damages.",
                "[Removed]",
                "The Nasdaq ended higher on Friday, driven by megacap shares, as investors awaited quarterly results from some of Wall Street's biggest companies next week.",
                "{beacon} Energy & Environment Energy & Environment   The Big Story  Lithium mining project approved despite concerns over wildflower The Biden administration this week gave final approval to a  Nevada lithium mining project that officials say could supply eno…",
                "Mike Jeffries and his partner are accused of pressuring young men who sought modeling jobs with the retailer into unwanted sex acts.",
                "Musk's high-profile support of one of the world's most controversial political figures goes well beyond the typical political activities of public company CEOs, raising novel questions about Tesla's obligations to shareholders.",
                "The 19-year-old Walmart employee who likely burned to death in the bakery's walk-in oven has been identified.",
                "Sandwich chain Jimmy John's is unveiling the Picklewich, a sandwich that replaces the bread with a giant kosher dill pickle.",
                "Brazil’s President Luiz Inácio Lula da Silva has signed an agreement worth tens of billions of dollars with the mining companies responsible for a 2015 dam collapse that was one of the country’s worst-ever environmental disasters. Under the agreement, Samarco…"
            ]
        },
        "entertainment": {
            "links": [
                "https://www.youtube.com/watch?v\\\\u003dU7WFiH66tRw",
                "https://www.washingtonpost.com/obituaries/2024/10/25/phil-lesh-grateful-dead-dies/",
                "https://www.yahoo.com/entertainment/lily-allen-says-she-earns-010816093.html",
                "http://deadline.com/2024/10/rapper-lil-durk-charged-orchestrating-cold-blooded-2022-murder-hire-la-1236158958/",
                "https://www.usatoday.com/story/entertainment/celebrities/2024/10/25/sean-diddy-combs-loses-bid-for-government-gag-order/75849409007/",
                "https://www.yourtango.com/2024379766/zodiac-signs-amazing-horoscopes-october-26-2024",
                "https://www.bbc.com/news/articles/c170l0n8j54o",
                "https://www.eonline.com/news/1409156/tom-holland-rescues-zendaya-from-swarm-of-paparazzi",
                "https://www.eonline.com/news/1409150/pete-davidson-unveils-results-of-his-major-tattoo-removal",
                "http://www.rollingstone.com/tv-movies/tv-movie-news/james-franco-seth-rogen-friendship-fallout-allegations-1235143552/"
            ],
            "titles": [
                "Jimmy and Jey Uso reunite after ripping gold from The Bloodline: SmackDown highlights, Oct. 25, 2024 - WWE",
                "Phil Lesh, founding member of the Grateful Dead, dies at 84 - The Washington Post",
                "Lily Allen says she earns more money selling foot photos than streams of her music - Yahoo Entertainment",
                "Rapper Lil Durk Charged With Orchestrating “Cold-Blooded” 2022 Murder-For-Hire In LA - Deadline",
                "Sean 'Diddy' Combs loses bid for gag order to prevent alleged government leaks - USA TODAY",
                "5 Zodiac Signs With Amazing Horoscopes On October 26, 2024 - YourTango",
                "What's next for the Menendez brothers? - BBC.com",
                "Tom Holland Rescues Zendaya From Swarm of Paparazzi, Proving He's the Ultimate Protective Boyfriend - E! Online - E! NEWS",
                "Pete Davidson Unveils Results of His Major Tattoo Removal - E! Online - E! NEWS",
                "James Franco Talks Seth Rogen Friendship Fallout After Allegations: ‘I Guess It’s Over’ - Rolling Stone"
            ],
            "published_dates": [
                "2024-10-26T03:14:06Z",
                "2024-10-26T02:31:32Z",
                "2024-10-26T01:08:00Z",
                "2024-10-25T23:22:00Z",
                "2024-10-25T23:16:23Z",
                "2024-10-25T23:04:31Z",
                "2024-10-25T23:02:15Z",
                "2024-10-25T22:58:00Z",
                "2024-10-25T22:25:00Z",
                "2024-10-25T20:39:28Z"
            ],
            "sources": [
                "WWE",
                "Brian Murphy",
                "Ashley Hume",
                "Glenn Garner",
                "KiMi Robinson",
                "Valeria Black",
                null,
                null,
                null,
                "Jon Blistein"
            ],
            "descriptions": [
                null,
                "Mr. Lesh brought an avant-garde bass style to the band and contributed to hits such as “Box of Rain.”",
                "Lily Allen revealed she earns more income from selling photos and videos of her feet on OnlyFans than from streams of her music on Spotify.",
                "Grammy winner Lil Durk has been arrested on federal charges for a 2022 murder-for-hire plot against fellow rapper Quando Rondo in Los Angeles.",
                "Sean \"Diddy\" Combs' lawyers have accused government agencies investigating the mogul of leaking statements to the press. A judge vowed to take action.",
                "Five zodiac signs have amazing horoscopes on October 26, 2024. They are: Aries, Pisces, Leo, Cancer, and Capricorn.",
                "A district attorney will argue for the brothers' resentencing on Friday - but freedom is still a long way off.",
                "Tom Holland proved he's a real-life superhero as he helped save girlfriend Zendaya from a large group of paparazzi and autograph-seeking fans in New York City on Oct. 24.",
                "Pete Davidson, who shared he was in the process of removing his tattoos in 2020, unveiled the treatment's results while attending an event at Los Angeles' Intuit Dome with Machine Gun Kelly.",
                "James Franco discussed the end of his friendship and working relationship with Seth Rogen after Franco was accused of sexual misconduct."
            ]
        },
        "health": {
            "links": [
                "https://removed.com",
                "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Can-prayer-identify-an-HIV-patient-UG-blasts-Rev-Lawrence-Tetteh-over-claim-of-high-surge-in-cases-on-campus-1957147",
                "https://apnews.com/article/mcdonalds-e-coli-outbreak-quarter-pounder-a1ec3dc14636f5e713b15b32aedcd524",
                "https://arstechnica.com/health/2024/10/ars-live-join-us-tuesday-as-we-discuss-glp-1-drugs-insights-and-unknowns/",
                "https://www.wjcl.com/article/raccoon-tests-positive-for-rabies-in-guyton/62720622",
                "https://www.washingtonpost.com/lifestyle/2024/10/25/breast-cancer-survivor-cancerversary/",
                "https://paradepets.com/pet-news/golden-retriever-sweet-way-asking-to-sleep-in-moms-room",
                "https://removed.com",
                "https://www.livescience.com/health/coronavirus/older-adults-should-get-2-doses-of-the-updated-covid-shot-cdc-says",
                "https://dailygalaxy.com/2024/10/scientists-uncover-alarming-chimp-behavior-tiny-factor-may-have-averted-pandemic/"
            ],
            "titles": [
                "[Removed]",
                "Can prayer identify an HIV patient? – UG blasts Rev. Lawrence Tetteh over claim of high surge in cases on campus - GhanaWeb",
                "At least 75 people are sickened as the deadly McDonald’s E. coli outbreak expands - The Associated Press",
                "Ars Live: Join us Tuesday as we discuss GLP-1 drugs—insights and unknowns - Ars Technica",
                "Raccoon tests positive for rabies in Guyton - WJCL News Savannah",
                "She threw a 70s-themed ‘cancerversary’ to ‘dance in death’s face’ - The Washington Post",
                "Golden Retriever's Sweet Way of Asking to Sleep in Mom's Room Is Melting Hearts - Yahoo Life",
                "[Removed]",
                "Older adults should get 2 doses of the updated COVID shot, CDC says - Livescience.com",
                "Scientists uncover alarming chimp behavior : Tiny factor may have averted pandemic - The Daily Galaxy --Great Discoveries Channel"
            ],
            "published_dates": [
                "2024-10-26T00:56:47Z",
                "2024-10-25T22:21:02Z",
                "2024-10-25T22:00:00Z",
                "2024-10-25T21:18:12Z",
                "2024-10-25T20:38:00Z",
                "2024-10-25T20:35:24Z",
                "2024-10-25T20:30:00Z",
                "2024-10-25T20:11:04Z",
                "2024-10-25T20:00:00Z",
                "2024-10-25T20:00:00Z"
            ],
            "sources": [
                null,
                null,
                "JONEL ALECCIA",
                "Beth Mole",
                "Kate Saxton",
                "Amber Ferguson, Drea Cornejo",
                "Devan McGuinness",
                null,
                "Nicoletta Lanese",
                null
            ],
            "descriptions": [
                "[Removed]",
                "The University of Ghana has denied assertions by Rev. Lawrence Tetteh, the Founder and President of World Miracle Outreach, that there is an upsurge in HIV cases among students on campus.",
                "A food poisoning outbreak tied to McDonald's Quarter Pounders has expanded, with at least 75 people sickened in 13 states. The Centers for Disease Control and Prevention said Friday that at least 22 people have been hospitalized. One person in Colorado died. …",
                "Dr. Daniel Drucker will discuss what ahead for these blockbuster drugs.",
                "Effingham County Health Department is alerting neighbors",
                "Deltra James was 33 when she was diagnosed with Stage 4 triple-negative metastatic breast cancer. Five years later, this is how she’s celebrating life.",
                "This is the definition of sweet!",
                "[Removed]",
                "The 2024-2025 COVID-19 vaccines are available, and the CDC recommends that adults over 65 and immunocompromised people get two doses, spaced six months apart.",
                "In a groundbreaking study, scientists have uncovered alarming behavioral changes in chimpanzees that could have far-reaching implications for human health. The research, conducted in Uganda's Budongo Forest, reveals a disturbing shift in chimp diets that may …"
            ]
        },
        "science": {
            "links": [
                "https://www.foxnews.com/us/nasa-astronaut-hospitalized-medical-issue-crews-delayed-return-space-station",
                "https://www.nasaspaceflight.com/2024/10/spacex-aces-flight-5-flight-6/",
                "https://scitechdaily.com/asteroid-chemistry-reveals-earths-secret-ingredient-for-life/",
                "https://www.cnn.com/2024/10/25/science/spacex-polaris-dawn-astronaut-health/index.html",
                "https://www.sfgate.com/bayarea/article/uc-berkeley-scientists-make-climate-discovery-19861548.php",
                "https://www.livescience.com/animals/extinct-species/predatory-birds-from-the-jurassic-may-have-driven-cicada-evolution-for-millions-of-years",
                "https://www.artofmanliness.com/odds-ends/odds-ends-october-25-2024/",
                "https://phys.org/news/2024-10-analysis-milky-central-supermassive-black.html",
                "https://www.newsweek.com/nasa-images-reveal-stark-changes-washingtons-mount-baker-1974865",
                "https://www.livescience.com/space/black-holes/accidental-discovery-of-1st-ever-black-hole-triple-system-challenges-what-we-know-about-how-singularities-form"
            ],
            "titles": [
                "NASA astronaut hospitalized with medical issue after crew’s delayed return from space station - Fox News",
                "SpaceX success with Flight 5, Flight 6 already tested - NASASpaceflight.com",
                "Asteroid Chemistry Reveals Earth’s Secret Ingredient for Life - SciTechDaily",
                "‘My vision started to deteriorate’: Polaris Dawn crew reveals impacts of history-making mission - CNN",
                "UC Berkeley scientists make groundbreaking climate discovery - SFGATE",
                "Predatory birds from the Jurassic may have driven cicada evolution for millions of years - Livescience.com",
                "Odds & Ends: October 25, 2024 - Art of Manliness",
                "Re-analysis of Milky Way's central supermassive black hole shows elongated structure - Phys.org",
                "NASA Images Reveal Stark Changes on Washington's Mount Baker - Newsweek",
                "Accidental discovery of 1st-ever 'black hole triple' system challenges what we know about how singularities form - Livescience.com"
            ],
            "published_dates": [
                "2024-10-26T01:59:00Z",
                "2024-10-25T22:24:45Z",
                "2024-10-25T21:04:03Z",
                "2024-10-25T21:01:00Z",
                "2024-10-25T20:55:25Z",
                "2024-10-25T18:00:00Z",
                "2024-10-25T17:11:10Z",
                "2024-10-25T16:40:19Z",
                "2024-10-25T15:37:38Z",
                "2024-10-25T15:20:47Z"
            ],
            "sources": [
                "Brie Stimson",
                "Ryan Weber",
                null,
                "Jackie Wattles",
                "Tessa McLean",
                "Sierra Bouchér",
                "Brett & Kate McKay",
                "National Astronomical Observatory of Japan",
                "Tom Howarth",
                "Harry Baker"
            ],
            "descriptions": [
                "NASA said that one astronaut remains hospitalized Friday, hours after a four-person crew from the International Space Station splashed down off the coast of Florida.",
                "SpaceX completed a significant milestone in the Starship program with Flight 5 and is set…",
                "Zinc in meteorites reveals Earth's essential volatiles came from unmelted asteroids, crucial for life. This insight may guide the search for life on other planets. Researchers have analyzed the chemical signatures of zinc in meteorites to trace the origin of …",
                "In an interview with CNN, the four civilian crew members behind SpaceX’s history-making Polaris Dawn mission reported different symptoms and ailments during their five-day journey last month.",
                "UC Berkeley scientists recently made a discovery that could help potentially mitigate the effects of climate change.",
                "Researchers calculated the flight ability of more than 80 ancient cicada species to analyze their evolution over time.",
                "In Harm’s Way: The Sinking of the USS Indianapolis and the Extraordinary Story of Its Survivors by Doug Stanton. If you watch Jaws, and find yourself prompted by Quint’s monologue to learn more about the sinking of the USS Indianapolis, you’ve got to pick up …",
                "A research team led by Assistant Professor Makoto Miyoshi of the National Astronomical Observatory of Japan (NAOJ) has independently re-analyzed observation data of the supermassive black hole at the center of the Milky Way galaxy obtained and published by th…",
                "Decades of satellite imagery and ground observations reveal record-breaking glacier retreat.",
                "Researchers spotted a second distant star orbiting a well-known black hole and its stellar companion in a never-before-seen gravitational triad. The system's unique configuration suggests that the black hole was not created as scientists initially expected."
            ]
        },
        "sports": {},
        "technology": {}
    }
}