{
    "timestamp": "2024-10-27T14:38:16.469578",
    "articles": {
        "business": {
            "links": [
                "https://fortune.com/2024/10/25/boeing-space-business-sale-jeff-bezoss-blue-origin-elon-musk-spacex/",
                "https://fortune.com/2024/10/25/donald-trump-net-worth-election/",
                "https://www.bbc.com/news/articles/cx2dk8yy4kjo",
                "https://www.ft.com/content/a223c0fc-f777-49a0-8e60-48e096cee0db",
                "https://www.wsj.com/business/airlines/delta-sues-crowdstrike-over-july-operations-meltdown-099ad8fa",
                "https://ambcrypto.com/safe-crypto-up-76-in-24-hours-will-the-breakout-lead-to-2-37/",
                "https://removed.com",
                "https://www.reuters.com/markets/us/futures-gain-treasury-yields-fall-tesla-slips-2024-10-25/",
                "https://markets.businessinsider.com/news/stocks/nuclear-power-stocks-ai-energy-oklo-smr-nuscale-cameco-bwxt-2024-10",
                "https://www.cnn.com/2024/10/25/tech/elon-musk-political-meetings-influence-dg/index.html"
            ],
            "titles": [
                "Boeing may put its iconic space business up for sale and had talks with Jeff Bezos's Blue Origin, report says - Fortune",
                "Trump says he’s ‘really, really rich.’ With a possible presidential victory looming, here’s how much he’s actually worth - Fortune",
                "Mining giants sign $30bn settlement for Brazil 2015 dam collapse - BBC.com",
                "Beyoncé brings star power as Kamala Harris touts ‘freedom’ in Texas - Financial Times",
                "Delta Sues CrowdStrike Over July Operations Meltdown - The Wall Street Journal",
                "SAFE crypto up 76% in 24 hours: Will the breakout lead to $2.37? - AMBCrypto News",
                "[Removed]",
                "Nasdaq closes higher ahead of a heavy week of earnings - Reuters",
                "Nuclear power stocks are soaring amid an AI energy push. Here are 7 names to watch. - Yahoo Finance",
                "Elon Musk’s dozens of meetings with presidents, prime ministers and political candidates show his growing political influence - CNN"
            ],
            "published_dates": [
                "2024-10-26T07:19:51Z",
                "2024-10-26T05:43:21Z",
                "2024-10-26T04:18:06Z",
                "2024-10-26T02:37:08Z",
                "2024-10-26T01:12:00Z",
                "2024-10-26T00:01:47Z",
                "2024-10-25T23:29:45Z",
                "2024-10-25T23:26:39Z",
                "2024-10-25T23:18:48Z",
                "2024-10-25T23:16:00Z"
            ],
            "sources": [
                "Jason Ma",
                "Jane Thier",
                null,
                null,
                "The Wall Street Journal",
                "Erastus Chami",
                null,
                "Lisa Mattackal, Purvi Agarwal, Carolina Mandl",
                "Matthew Fox",
                "Clare Duffy, Way Mullery"
            ],
            "descriptions": [
                "That could include the Starliner space taxi program and operations related to the International Space Station, sources told the Wall Street Journal.",
                "The explosion of Trump Media has led the personal wealth of its founder to skyrocket.",
                "The dam collapse released toxic waste and mud, which flooded nearby towns, rivers and forests.",
                "Vice-president seeks to energise women voters as White House race against Donald Trump tightens",
                null,
                "Safe’s breakout could propel it toward $2.37 as strong momentum builds in the market.",
                "[Removed]",
                "The Nasdaq ended higher on Friday, driven by megacap shares, as investors awaited quarterly results from some of Wall Street's biggest companies next week.",
                "The best-performing nuclear stock has soared 481% so far this year as mega-cap tech companies strike deals for nuclear power.",
                "Over the past three years, Elon Musk has met dozens of times with presidents, prime ministers, lawmakers, government officials and political candidates from around the world."
            ]
        },
        "entertainment": {
            "links": [
                "https://chicago.suntimes.com/horoscopes/2024/10/26/horoscopes-today-saturday-october-26-2024",
                "http://www.hollywoodreporter.com/movies/movie-reviews/here-review-tom-hanks-robin-wright-robert-zemeckis-1236045912/",
                "https://www.bbc.com/news/articles/c170l0n8j54o",
                "https://www.youtube.com/watch?v\\\\u003dU7WFiH66tRw",
                "https://www.washingtonpost.com/obituaries/2024/10/25/phil-lesh-grateful-dead-dies/",
                "https://removed.com",
                "https://www.yahoo.com/entertainment/lily-allen-says-she-earns-010816093.html",
                "https://www.usatoday.com/story/entertainment/celebrities/2024/10/25/sean-diddy-combs-loses-bid-for-government-gag-order/75849409007/",
                "https://www.eonline.com/news/1409156/tom-holland-rescues-zendaya-from-swarm-of-paparazzi",
                "https://www.eonline.com/news/1409150/pete-davidson-unveils-results-of-his-major-tattoo-removal"
            ],
            "titles": [
                "Horoscope for Saturday, October 26, 2024 - Chicago Sun-Times",
                "'Here' Review: Tom Hanks and Robin Wright Reunite With Robert Zemeckis - Hollywood Reporter",
                "What's next for the Menendez brothers? - BBC.com",
                "Jimmy and Jey Uso reunite after ripping gold from The Bloodline: SmackDown highlights, Oct. 25, 2024 - WWE",
                "Phil Lesh, founding member of the Grateful Dead, dies at 84 - The Washington Post",
                "[Removed]",
                "Lily Allen says she earns more money selling foot photos than streams of her music - Yahoo Entertainment",
                "Sean 'Diddy' Combs loses bid for gag order to prevent alleged government leaks - USA TODAY",
                "Tom Holland Rescues Zendaya From Swarm of Paparazzi, Proving He's the Ultimate Protective Boyfriend - E! Online - E! NEWS",
                "Pete Davidson Unveils Results of His Major Tattoo Removal - E! Online - E! NEWS"
            ],
            "published_dates": [
                "2024-10-26T05:01:32Z",
                "2024-10-26T04:30:54Z",
                "2024-10-26T03:59:52Z",
                "2024-10-26T03:14:06Z",
                "2024-10-26T02:31:32Z",
                "2024-10-26T01:46:59Z",
                "2024-10-26T01:08:00Z",
                "2024-10-25T23:16:23Z",
                "2024-10-25T22:58:00Z",
                "2024-10-25T22:25:00Z"
            ],
            "sources": [
                "Georgia Nicols",
                "David Rooney",
                null,
                "WWE",
                "Brian Murphy",
                null,
                "Ashley Hume",
                "KiMi Robinson",
                null,
                null
            ],
            "descriptions": [
                null,
                "Premiering at AFI Fest, the director's reunion with his ‘Forrest Gump’ stars and screenwriter Eric Roth also features Paul Bettany, Kelly Reilly and Michelle Dockery.",
                "A district attorney will argue for the brothers' resentencing on Friday - but freedom is still a long way off.",
                null,
                "Mr. Lesh brought an avant-garde bass style to the band and contributed to hits such as “Box of Rain.”",
                "[Removed]",
                "Lily Allen revealed she earns more income from selling photos and videos of her feet on OnlyFans than from streams of her music on Spotify.",
                "Sean \"Diddy\" Combs' lawyers have accused government agencies investigating the mogul of leaking statements to the press. A judge vowed to take action.",
                "Tom Holland proved he's a real-life superhero as he helped save girlfriend Zendaya from a large group of paparazzi and autograph-seeking fans in New York City on Oct. 24.",
                "Pete Davidson, who shared he was in the process of removing his tattoos in 2020, unveiled the treatment's results while attending an event at Los Angeles' Intuit Dome with Machine Gun Kelly."
            ]
        },
        "health": {
            "links": [
                "https://www.cdc.gov/ecoli/outbreaks/e-coli-O157.html",
                "https://removed.com",
                "https://www.tri-cityherald.com/news/local/article294480529.html",
                "https://www.ghanaweb.com/GhanaHomePage/NewsArchive/Can-prayer-identify-an-HIV-patient-UG-blasts-Rev-Lawrence-Tetteh-over-claim-of-high-surge-in-cases-on-campus-1957147",
                "https://arstechnica.com/health/2024/10/ars-live-join-us-tuesday-as-we-discuss-glp-1-drugs-insights-and-unknowns/",
                "https://www.wjcl.com/article/raccoon-tests-positive-for-rabies-in-guyton/62720622",
                "https://paradepets.com/pet-news/golden-retriever-sweet-way-asking-to-sleep-in-moms-room",
                "https://www.youtube.com/watch?v\\\\u003dsj46E0eJI0w",
                "https://www.livescience.com/health/coronavirus/older-adults-should-get-2-doses-of-the-updated-covid-shot-cdc-says",
                "https://dailygalaxy.com/2024/10/scientists-uncover-alarming-chimp-behavior-tiny-factor-may-have-averted-pandemic/"
            ],
            "titles": [
                "E. coli Outbreak Linked to McDonald’s Quarter Pounders - CDC",
                "[Removed]",
                "More egg farm workers sick with avian flu. CDC sends help for Eastern WA outbreak - Tri-City Herald",
                "Can prayer identify an HIV patient? – UG blasts Rev. Lawrence Tetteh over claim of high surge in cases on campus - GhanaWeb",
                "Ars Live: Join us Tuesday as we discuss GLP-1 drugs—insights and unknowns - Ars Technica",
                "Raccoon tests positive for rabies in Guyton - WJCL News Savannah",
                "Golden Retriever's Sweet Way of Asking to Sleep in Mom's Room Is Melting Hearts - Yahoo Life",
                "Balancing on one leg to spot early signs of aging - Good Morning America",
                "Older adults should get 2 doses of the updated COVID shot, CDC says - Livescience.com",
                "Scientists uncover alarming chimp behavior : Tiny factor may have averted pandemic - The Daily Galaxy --Great Discoveries Channel"
            ],
            "published_dates": [
                "2024-10-26T06:36:54Z",
                "2024-10-26T00:56:47Z",
                "2024-10-25T23:43:00Z",
                "2024-10-25T22:21:02Z",
                "2024-10-25T21:18:12Z",
                "2024-10-25T20:38:00Z",
                "2024-10-25T20:30:00Z",
                "2024-10-25T20:28:53Z",
                "2024-10-25T20:00:00Z",
                "2024-10-25T20:00:00Z"
            ],
            "sources": [
                "CDC",
                null,
                "Annette Cary",
                null,
                "Beth Mole",
                "Kate Saxton",
                "Devan McGuinness",
                "Good Morning America",
                "Nicoletta Lanese",
                null
            ],
            "descriptions": [
                "Learn about a multistate outbreak of <em>E. coli </em>infections linked to burgers.",
                "[Removed]",
                "More chicken egg farm workers in Pasco area suspected of having avian or bird influenza H5N1 in outbreak in Franklin County. CDC on site.",
                "The University of Ghana has denied assertions by Rev. Lawrence Tetteh, the Founder and President of World Miracle Outreach, that there is an upsurge in HIV cases among students on campus.",
                "Dr. Daniel Drucker will discuss what ahead for these blockbuster drugs.",
                "Effingham County Health Department is alerting neighbors",
                "This is the definition of sweet!",
                null,
                "The 2024-2025 COVID-19 vaccines are available, and the CDC recommends that adults over 65 and immunocompromised people get two doses, spaced six months apart.",
                "In a groundbreaking study, scientists have uncovered alarming behavioral changes in chimpanzees that could have far-reaching implications for human health. The research, conducted in Uganda's Budongo Forest, reveals a disturbing shift in chimp diets that may …"
            ]
        },
        "science": {
            "links": [
                "https://scitechdaily.com/?p=426807",
                "https://scitechdaily.com/a-single-workout-can-improve-your-brain-heres-what-scientists-found/",
                "https://spacenews.com/starship-super-heavy-booster-came-within-one-second-of-aborting-first-catch-landing/",
                "https://www.ksl.com/article/51163187/west-valley-school-celebrates-nasa-donation-by-planting-moon-tree",
                "https://www.sciencealert.com/scientists-peered-inside-the-tiniest-dinosaur-egg-ever-found",
                "https://scitechdaily.com/asteroid-chemistry-reveals-earths-secret-ingredient-for-life/",
                "https://www.cnn.com/2024/10/25/science/spacex-polaris-dawn-astronaut-health/index.html",
                "https://www.sfgate.com/bayarea/article/uc-berkeley-scientists-make-climate-discovery-19861548.php",
                "https://www.space.com/the-universe/solar-system/comet-tsuchinshan-atlas-dust-trail-navy-telescope-photos",
                "https://phys.org/news/2024-10-reveals-mammal-evolution-sprawling-upright.html"
            ],
            "titles": [
                "NASA Astronaut Hospitalized: Unraveling the Medical Mystery After Crew-8’s Space Odyssey - SciTechDaily",
                "A Single Workout Can Improve Your Brain: Here’s What Scientists Found - SciTechDaily",
                "Starship Super Heavy booster came within one second of aborting first “catch” landing - SpaceNews",
                "West Valley school celebrates NASA donation by planting 'moon tree' - KSL.com",
                "Scientists Peered Inside The Tiniest Dinosaur Egg Ever Found - ScienceAlert",
                "Asteroid Chemistry Reveals Earth’s Secret Ingredient for Life - SciTechDaily",
                "‘My vision started to deteriorate’: Polaris Dawn crew reveals impacts of history-making mission - CNN",
                "UC Berkeley scientists make groundbreaking climate discovery - SFGATE",
                "See Comet Tsuchinshan-ATLAS eject a tail of gas and dust as it flies past the sun (photos) - Space.com",
                "Study reveals the twists and turns of mammal evolution from a sprawling to upright posture - Phys.org"
            ],
            "published_dates": [
                "2024-10-26T07:17:44Z",
                "2024-10-26T02:02:41Z",
                "2024-10-25T23:42:26Z",
                "2024-10-25T23:18:43Z",
                "2024-10-25T22:31:28Z",
                "2024-10-25T21:04:03Z",
                "2024-10-25T21:01:00Z",
                "2024-10-25T20:55:25Z",
                "2024-10-25T20:00:00Z",
                "2024-10-25T18:00:16Z"
            ],
            "sources": [
                null,
                null,
                "",
                "Ivy Farguheson, KSL.com",
                "Tessa Koumoundouros",
                null,
                "Jackie Wattles",
                "Tessa McLean",
                "Elizabeth Howell",
                "Harvard University"
            ],
            "descriptions": [
                "Following the splashdown of the SpaceX Crew-8 mission, one astronaut remains under medical observation, with the others safely back in Houston. The crew had completed a mission of over 235 days in space, conducting scientific research at the International Spa…",
                "UC Santa Barbara researchers discovered that single, vigorous exercise sessions, especially under 30 minutes, improve cognitive functions like memory and executive function. Future studies will explore whether combining physical activity with cognitive tasks …",
                "SpaceX’s Super Heavy booster came within a second of aborting a “catch” landing attempt on the latest Starship test flight, according to audio posted online, apparently inadvertently, by Elon Musk.…",
                "Neil Armstrong Academy in West Valley City on Friday planted a \"moon tree\" sapling from NASA and the U.S. Forest Service that traveled on the Artemis I Orion spacecraft in 2022.",
                "A delicate, three-year analysis confirms the 'Ganzhou Mini Egg' is the tiniest dinosaur egg ever known.",
                "Zinc in meteorites reveals Earth's essential volatiles came from unmelted asteroids, crucial for life. This insight may guide the search for life on other planets. Researchers have analyzed the chemical signatures of zinc in meteorites to trace the origin of …",
                "In an interview with CNN, the four civilian crew members behind SpaceX’s history-making Polaris Dawn mission reported different symptoms and ailments during their five-day journey last month.",
                "UC Berkeley scientists recently made a discovery that could help potentially mitigate the effects of climate change.",
                "The comet's dust trail was more visible in a Navy space telescope than any other.",
                "Mammals, including humans, stand out with their distinctively upright posture, a key trait that fueled their spectacular evolutionary success. Yet, the earliest known ancestors of modern mammals more resembled reptiles, with limbs stuck out to their sides in …"
            ]
        },
        "sports": {
            "links": [
                "https://nypost.com/2024/10/25/sports/yankees-lose-game-1-of-world-series-on-walkoff-grand-slam/",
                "https://www.mlb.com/news/yankees-2024-world-series-roster",
                "https://www.blazersedge.com/2024/10/25/24279926/portland-trail-blazers-new-orleans-pelicans-final-score-simons-scoot-henderson-ayton-jerami-grant",
                "https://www.youtube.com/watch?v\\\\u003dwxwkddJkn_8",
                "https://www.usatoday.com/story/sports/nba/lakers/2024/10/26/bronny-james-suns-lakers-stats/75843084007/",
                "https://www.nbcsportsbayarea.com/nba/golden-state-warriors/steph-curry-buddy-hield-andrew-wiggins/1797971/",
                "https://sports.yahoo.com/world-series-fan-interference-ruling-at-dodger-stadium-keeps-yankees-scoreless-on-pivotal-play-031219365.html",
                "https://www2.kusports.com/sports/college/basketball-men/2024/oct/25/quick-recap-down-key-players-ku-drops-sloppy-exhibition-game-at-arkansas-85-69/",
                "https://www.cbssports.com/mlb/news/dodgers-win-epic-world-series-game-1-over-yankees-on-freddie-freemans-historic-walk-off-grand-slam-in-extras/live/",
                "https://www.deseret.com/sports/2024/10/25/byu-football-ucf-knights-game-preview/"
            ],
            "titles": [
                "Yankees blow Game 1 of World Series on Freddie Freeman’s walkoff grand slam - New York Post ",
                "Cortes added, Berti off World Series roster - MLB.com",
                "Trail Blazers Play Great Behind Grant, Clingan, Fall to Pelicans - Blazer's Edge",
                "SUNS at LAKERS | FULL GAME HIGHLIGHTS | October 25, 2024 - NBA",
                "Did Bronny James play tonight? Suns-Lakers box score - USA TODAY",
                "What we learned as Hield's historic start fuels Warrriors win vs. Jazz - NBC Sports Bay Area",
                "World Series: Fan interference ruling at Dodger Stadium keeps Yankees scoreless on pivotal play - Yahoo Sports",
                "Quick recap: Down key players, KU drops sloppy exhibition game at Arkansas, 85-69 - KUsports",
                "World Series score: Live updates as Yankees and Dodgers open Fall Classic with Game 1 in Los Angeles - CBS Sports",
                "BYU vs. UCF: Can struggling Knights bounce No. 11 Cougars from the Big 12 title race in steamy Orlando Saturday? - Deseret News"
            ],
            "published_dates": [
                "2024-10-26T06:45:00Z",
                "2024-10-26T06:30:54Z",
                "2024-10-26T05:08:46Z",
                "2024-10-26T04:46:55Z",
                "2024-10-26T04:46:48Z",
                "2024-10-26T03:50:30Z",
                "2024-10-26T03:31:00Z",
                "2024-10-26T03:22:47Z",
                "2024-10-26T03:05:59Z",
                "2024-10-26T03:00:00Z"
            ],
            "sources": [
                "Mark W. Sanchez",
                "Bryan Hoch",
                "Dave Deckard",
                "NBA",
                "Jon Hoefling",
                "Monte Poole",
                "Jack Baer",
                null,
                "R.J. Anderson",
                "Jay Drew"
            ],
            "descriptions": [
                "The Yankees let Game 1 of the World Series slip away in painful fashion.",
                "LOS ANGELES -- The Yankees announced their World Series roster prior to Game 1 against the Dodgers on Friday night in Los Angeles, selecting left-hander Nestor Cortes and removing infielder Jon Berti, who is unavailable due to a right hip flexor strain.\nThe 2…",
                "Portland comes up one shot short of victory.",
                null,
                "Bronny James did not see the court in the Lakers' 123-116 victory over the Suns.",
                "Buddy Hield's red-hot shooting propelled the Golden State Warriors' historic 127-86 win over the Utah Jazz on Friday night at Delta Center.",
                "Jeffrey Maier 2.0? This one went a little differently for the Yankees.",
                "Fayetteville, Ark. — Throughout the preseason, Kansas men’s basketball coach Bill Self has referred to his ongoing efforts to determine how the Jayhawks’ disparate pieces fit together. Playing without several of the most important pieces of that puzzle — pres…",
                "Freeman's heroics were the first walk-off grand slam in World Series history",
                "BYU (7-0) faces a stiff test on Saturday in Orlando, even though UCF has lost four straight games and is struggling in its second season in the Big 12"
            ]
        },
        "technology": {
            "links": [
                "https://www.theverge.com/2024/10/25/24279853/apple-wins-a-battle-and-250-in-its-smartwatch-patent-fight-with-masimo",
                "https://spacenews.com/starship-super-heavy-booster-came-within-one-second-of-aborting-first-catch-landing/",
                "https://www.gamespot.com/gallery/call-of-duty-black-ops-6-safe-code-all-safehouse-puzzle-solutions/2900-5895/",
                "https://www.polygon.com/mtg-magic-the-gathering/470491/final-fantasy-art-reveal-universes-beyond-standard-legal-announcement",
                "https://www.thegamer.com/magic-the-gathering-mtg-foundations-jumpstart-visual-spoiler-every-card/",
                "https://www.youtube.com/",
                "http://9to5google.com/2024/10/25/gemini-2-0-december/",
                "https://www.dailydot.com/news/chilis-lemon-water/",
                "https://arstechnica.com/gaming/2024/10/copyright-office-libraries-cant-share-remotely-emulated-versions-of-physical-games/",
                "https://removed.com"
            ],
            "titles": [
                "Apple wins a battle (and $250) in its smartwatch patent fight with Masimo - The Verge",
                "Starship Super Heavy booster came within one second of aborting first “catch” landing - SpaceNews",
                "Call of Duty: Black Ops 6 Safe Code - All Safehouse Puzzle Solutions - GameSpot",
                "Magic: The Gathering’s Final Fantasy reveal arrives with big changes for the beloved TCG - Polygon",
                "Every Card Revealed For Magic: The Gathering's Foundations Jumpstart - TheGamer",
                "SONIC X SHADOW GENERATIONS – Launch Trailer – Nintendo Switch - Nintendo of America",
                "Report: Google targeting December launch for Gemini 2.0 - 9to5Google",
                "‘You’re at a Chili’s’: Chili’s server issues PSA for customers who ask for lemon in their water - The Daily Dot",
                "Video game libraries lose legal appeal to emulate physical game collections online - Ars Technica",
                "[Removed]"
            ],
            "published_dates": [
                "2024-10-26T00:05:00Z",
                "2024-10-25T23:42:26Z",
                "2024-10-25T23:15:49Z",
                "2024-10-25T22:30:00Z",
                "2024-10-25T22:30:00Z",
                "2024-10-25T21:00:20Z",
                "2024-10-25T20:26:00Z",
                "2024-10-25T20:00:00Z",
                "2024-10-25T19:25:44Z",
                "2024-10-25T19:25:21Z"
            ],
            "sources": [
                "Jay Peters",
                "",
                "James Carr",
                "Charlie Hall",
                "Joe Parlock",
                null,
                "Abner Li",
                "Brooke Sjoberg",
                "Kyle Orland",
                null
            ],
            "descriptions": [
                "Apple earned a mixed victory in a patent infringement lawsuit against Masimo after a federal jury found that Masimo had infringed on some Apple patents.",
                "SpaceX’s Super Heavy booster came within a second of aborting a “catch” landing attempt on the latest Starship test flight, according to audio posted online, apparently inadvertently, by Elon Musk.…",
                "In the BO6 campaign you will find yourself in a safe house filled with puzzles, including a locked safe. Here's how to get it open.",
                "Magic: The Gathering’s Universes Beyond is going mainstream. Fans should now expect just three Magic Multiverse sets each year.",
                "One of the best ways to play is back with Magic: The Gathering's Foundations Jumpstart set.",
                "Enjoy the videos and music you love, upload original content, and share it all with friends, family, and the world on YouTube.",
                "In December of 2023, Google announced the first version of Gemini and the company is reportedly planning to launch Gemini 2.0 a year later.",
                "In a video, a Chili's server warns asking for lemon in your water might not be the best decision at Chili's.",
                "Register of Copyrights sides with industry’s “market harm” argument for rereleased games.",
                "[Removed]"
            ]
        }
    }
}